"""
Задание:

1. Для выполнения задания создайте директорию "Lesson 4".
В ней мы напишем простую проверялку, жив ли сайт по указанному адресу.

2. Установите библиотеку requests с помощью pip.

3. Создайте пакет website_alive,
внутри которого будут модули make_request и check_response.

4. Внутри модуля make_request напишите функцию,
которая делает запрос на сайт с использованием библиотеки requests,
и возвращает объект
(найдите документацию по библиотеке, вам будет достаточно раздела QuickStart)

5. Внутри модуля check_response напишите функцию,
которая на вход принимает URL как строку (например, 'http://google.ru/')
и использует функцию из предыдущего файла,
чтобы сделать запрос.
Если status_code равен 200, функция возвращает True, иначе False.

6. В корневой директории ("Lesson 4") создайте файл main.py,
который при запуске спрашивает у пользователя адрес сайта,
который необходимо проверить. Дальше делает проверку,
используя пакет website_alive, и пишет, доступен ли сайт.

7. В корневой директории создайте файл requirements.txt,
в котором укажите зависимости для вашего кода.

8. Используя анализаторы кода,
устраните все стилистические ошибки.
Не забывайте использовать их при выполнении дальнейших заданий :)
"""
#import website_alive.make_request as make_request
import website_alive.check_response as check

##Прошлый тест:
# my_url = "https://github.com/Dannilich/Artezio_HW"
# print(make_request.get_response(my_url))
# print(check.check_response(my_url))

URL = input("Проверка на доступность сайта,\n Введите его адрес: ")

if check.check_response(URL):
    print("Сайт доступен")
else:
    print("Сайт недоступен")

##что ему тут не нравиться ?(
# print("Сайт доступен") if check.check_response(URL) \
#     else print("Сайт недоступен")
